app/views/comics/index.html.erb

SELECT "comics".* FROM "comics"
---
        <% @profils_list.each do |profil| %>
          <% profil.user.comics.each do |comic| %>