app/controllers/comics_controller.rb

SELECT "comics".* FROM "comics"
---
  def index
    @comics = Comic.all

INSERT INTO "comics" ("title", "editor", "artist", "year", "price", "photo", "genre", "state", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @comic = Comic.new(comic_params)
    @comic.user = current_user if current_user


    if @comic.save

SELECT  "comics".* FROM "comics" WHERE "comics"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def set_comic
    @comic = Comic.find(params[:id])